Tekla Open API Reference for Tekla Structures 2025
AABB.IsInside Method (LineSegment)
 Checks if the given line segment is inside the current axis-aligned 3d bounding box.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsInside(
	LineSegment LineSegment
)
Public Function IsInside (
	LineSegment As LineSegment
) As Boolean
Parameters
LineSegment
Type: Tekla.Structures.Geometry3d.LineSegment
The line segment to be checked.
Return Value
Type: Boolean
True if the point is inside the current axis-aligned 3d bounding box.
See Also
Reference
AABB Class
IsInside Overload
Tekla.Structures.Geometry3d Namespace